jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
    w5500_dev = (struct spi_w5500_device *)dev;
    
    rt_spi_transfer(w5500_dev->spi_device,NULL,buffer,size);

    return(RT_EOK);	
}

/**
  * @brief : w5500 write data
  * @param : [dev] the device.
  * @param : [pos] the addr.
  * @param : [buffer] the pointer of data.
  * @param : [size] the size of data.
  * @return: [RT_EOK]/[RT_ERROR]
  * @updata: [2017-12-21][Sunxr][newly increased]
  */
static rt_size_t rt_hw_w5500_write(rt_device_t dev, rt_off_t addr, const void* buffer, rt_size_t size) 
{
    rt_spi_w5500_device_t w5500_dev;
    
    w5500_dev = (struct spi_w5500_device *)dev;
    
    rt_spi_transfer(w5500_dev->spi_device,buffer,NULL,size);

    return(RT_EOK);		
}


/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @brief Read the device of w5500.
  * @param [AddrSel] The address command.
  * @retval Return the byte has been readed.
  */
uint8_t WIZCHIP_READ(uint32_t AddrSel)
{
    uint8_t ret;

    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if  ( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_ )
   	   AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
   	   AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_FDM_OP_LEN1_);
   #else
      #error "Unsupported _WIZCHIP_IO_SPI_ in W5500 !!!"
   #endif
#if   !defined(SPI_DMA) 
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
    ret = WIZCHIP.IF.SPI._read_byte();
#else
   uint8_t spi_data[3];
   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
   spi_data[2] = (AddrSel & 0x000000F8);
   spi_dma_read(spi_data, &ret, 1);
#endif   

#elif ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_))

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5000. !!!"   
#endif

   WIZCHIP.CS._deselect();
   WIZCHIP_CRITICAL_EXIT();
	 
   return(ret);
}

/**
  * @brief Write to the w5500 device.
  * @param [AddrSel] The address command.
  * @param [wb] The data which will been writen to w5500.
  * @retval None.
  */
void WIZCHIP_WRITE(uint32_t AddrSel, uint8_t wb)
{
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_)
   	   AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
   	   AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_FDM_OP_LEN1_);
   #else
      #error "Unsupported _WIZCHIP_IO_SPI_ in W5500 !!!"
   #endif

#if   !defined(SPI_DMA)	
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
    WIZCHIP.IF.SPI._write_byte(wb);
#else
   uint8_t spi_data[3];
   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
   spi_data[2] =  (AddrSel & 0x000000F8) + 4;
   spi_dma_write(spi_data, &wb, 1);
#endif   

#elif ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_))

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5500. !!!"
#endif

    WIZCHIP.CS._deselect();
    WIZCHIP_CRITICAL_EXIT();
}
         
/**
  * @brief Read the buffer of w5500 device.
  * @param [AddrSel] The address command.
  * @param [pBuf] The buffer pointer.
  * @param [len] The data length.
  * @retval None.
  */
void WIZCHIP_READ_BUF (uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
    uint16_t i = 0;
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_)
      AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);

	#if   !defined(SPI_DMA) 
   	  WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
      for (i = 0; i < len; i++)
	    {
			    pBuf[i] = WIZCHIP.IF.SPI._read_byte();
			}
	#else
		uint8_t spi_data[3];
		spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
		spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
		spi_data[2] = (AddrSel & 0x000000F8);
		spi_dma_read(spi_data, pBuf, len);  
	#endif
			
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
      AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_FDM_OP_LEN4_);
      for (i = 0; i < len/4; i++, j)
      {
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          pBuf[i*4]   = WIZCHIP.IF.SPI._read_byte();
          pBuf[i*4+1] = WIZCHIP.IF.SPI._read_byte();
          pBuf[i*4+2] = WIZCHIP.IF.SPI._read_byte();            
          pBuf[i*4+3] = WIZCHIP.IF.SPI._read_byte();            
          AddrSel = WIZCHIP_OFFSET_INC(AddrSel,4);
      }
      len %= 4; // for the rest data
      // M20131220 : remove for loop
      i *= 4;        
      if (len >= 2)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN4_ to _W5500_SPI_FDM_OP_LEN2_

       //for (j = 0; j < len/2 ; j++)
          {
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
              pBuf[i]   = WIZCHIP.IF.SPI._read_byte();
              pBuf[i+1] = WIZCHIP.IF.SPI._read_byte();
              i += 2;
              AddrSel = WIZCHIP_OFFSET_INC(AddrSel,2);
          }
      }
      len %= 2;
      if (len)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN2_ to _W5500_SPI_FDM_OP_LEN1_
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          pBuf[i]   = WIZCHIP.IF.SPI._read_byte();
      }      
   #else
      #error "Unsupported _WIZCHIP_IO_MODE_SPI_ in W5500 !!!"
   #endif

#elif ( (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_) )

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5500. !!!!"
#endif

    WIZCHIP.CS._deselect();
    WIZCHIP_CRITICAL_EXIT();
}

/**
  * @brief Write the buffer to w5500 device.
  * @param [AddrSel] The address command.
  * @param [pBuf] The buffer pointer.
  * @param [len] The data length.
  * @retval None.
  */
void WIZCHIP_WRITE_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
    uint16_t i = 0;
//    uint16_t j = 0;
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if( (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if  ( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_ )
      AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);

   #if   !defined(SPI_DMA) 
   	  WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
	
      for (i = 0; i < len; i++)
	    {
          WIZCHIP.IF.SPI._write_byte(pBuf[i]);
			}
	#else
	   uint8_t spi_data[3];
	   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
	   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
	   spi_data[2] = (AddrSel & 0x000000F8) + 4;
	   spi_dma_write(spi_data, pBuf, len);  
	#endif   
			
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
      AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_FDM_OP_LEN4_);
			
      for (i = 0; i < len/4; i++)
      {
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4]  );
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+1]);
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+2]);            
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+3]);            
          AddrSel = WIZCHIP_OFFSET_INC(AddrSel,4);
      }
			
      len %= 4;      // for the rest data
      // M20131220 : Remove for loop
      i *= 4;
      if (len >= 2)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN4_ to _W5500_SPI_FDM_OP_LEN2_

