jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
    LL_DMA_InitStructure.PeriphOrM2MSrcAddress = (uint32_t)(&(SPI2->DR));
    LL_DMA_InitStructure.PeriphBurst = DMA_PBURST_SINGLE;
    LL_DMA_InitStructure.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
    LL_DMA_InitStructure.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;
    LL_DMA_InitStructure.PeriphOrM2MSrcIncMode =  LL_DMA_PERIPH_NOINCREMENT;
    LL_DMA_InitStructure.Priority = LL_DMA_PRIORITY_HIGH;
}

/* SPI2 init function */
void LL_SPI2_Init(void)
{   
	LL_SPI_InitTypeDef SPI_InitStruct;

	LL_GPIO_InitTypeDef GPIO_InitStruct;

	/* Peripheral clock enable */
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2);

	/**SPI2 GPIO Configuration  
	PI1   ------> SPI2_SCK
	PI2   ------> SPI2_MISO
	PI3   ------> SPI2_MOSI 
	*/
	GPIO_InitStruct.Pin = LL_GPIO_PIN_1|LL_GPIO_PIN_2|LL_GPIO_PIN_3;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	GPIO_InitStruct.Pull = LL_GPIO_PULL_DOWN;
	GPIO_InitStruct.Alternate = LL_GPIO_AF_5;
	LL_GPIO_Init(GPIOI, &GPIO_InitStruct);

	/* SPI2 parameter configuration*/
	SPI_InitStruct.TransferDirection = LL_SPI_FULL_DUPLEX;
	SPI_InitStruct.Mode = LL_SPI_MODE_MASTER;
	SPI_InitStruct.DataWidth = LL_SPI_DATAWIDTH_8BIT;
	SPI_InitStruct.ClockPolarity = LL_SPI_POLARITY_LOW;
	SPI_InitStruct.ClockPhase = LL_SPI_PHASE_1EDGE;
	SPI_InitStruct.NSS = LL_SPI_NSS_SOFT;
	SPI_InitStruct.BaudRate = LL_SPI_BAUDRATEPRESCALER_DIV2;
	SPI_InitStruct.BitOrder = LL_SPI_MSB_FIRST;
	SPI_InitStruct.CRCCalculation = LL_SPI_CRCCALCULATION_DISABLE;
	SPI_InitStruct.CRCPoly = 10;
	LL_SPI_Init(SPI2, &SPI_InitStruct);

	LL_SPI_SetStandard(SPI2, LL_SPI_PROTOCOL_MOTOROLA);
  #if   !defined(SPI_DMA) 
	LL_SPI_Enable(SPI2);  
  #else
    spi_dma_init();  
  #endif
	while (!LL_SPI_IsActiveFlag_TXE(SPI2));	
}

/**
  * @brief  w5500 device initialization.
  * @param  None.
  * @retval None.
  */
int rt_hw_w5500_init(void)
{
    uint8_t memsize[2][8] = {{4,2,2,2,2,2,1,1}, {4,2,2,2,2,2,1,1}};
    uint8_t tmp;
    uint32_t tickstart = 0;
       
    static rt_device_t device;	
    static struct rt_device_pin *w5500_irq_pin;	

    LL_SPI2_Init();
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);
    LL_DMA_DeInit(DMA1, LL_DMA_STREAM_3);
    LL_DMA_DeInit(DMA1, LL_DMA_STREAM_4);
		
    w5500_pin = (struct rt_device_pin *)rt_device_find(RT_PIN_NAME);	
    if (w5500_pin == RT_NULL)
    {
        W5500_PRINTF("w5500 pin device is not found!!! ");         
        return(1);
    }

    // First of all, Should register SPI callback functions implemented by user for accessing WIZCHIP 
    /* Critical section callback */
    reg_wizchip_cris_cbfunc(rt_enter_critical, rt_exit_critical); // registered critical function
			
    /* Chip selection call back */
  #if _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_
    reg_wizchip_cs_cbfunc(w5500_cs_select, w5500_cs_deselect); // registered SPI chip select function
  #elif _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_
    reg_wizchip_cs_cbfunc(SPI_CS_Select, SPI_CS_Deselect); // CS must be tried with LOW.
  #else
    #if (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SIP_) != _WIZCHIP_IO_MODE_SIP_
      #error "Unknown _WIZCHIP_IO_MODE_"
    #else
        reg_wizchip_cs_cbfunc(wizchip_select, wizchip_deselect);
    #endif
  #endif
			
    /* SPI Read & Write callback function */
    reg_wizchip_spi_cbfunc(w5500_ReadByte, w5500_WriteByte); // registered read and write function

    /* WIZCHIP SOCKET Buffer initialize */
    if (ctlwizchip(CW_INIT_WIZCHIP, (void*)memsize) == -1)
    {
        while(1);
    }
		
    /* Get tick */
    tickstart = HAL_GetTick();
		
    /* PHY link status check */
    do
    {
        if (ctlwizchip(CW_GET_PHYLINK, (void*)&tmp) == 0)
        {
            break;
        }
				
        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > ETH_TIMEOUT_LINKED_STATE)
        {
            break;
        }

    } while (tmp == PHY_LINK_OFF);

    w5500_irq_pin = (struct rt_device_pin *)rt_device_find(RT_PIN_NAME);
	
    if (w5500_irq_pin == RT_NULL)
    {
        W5500_PRINTF("pin device is not found!!!/r/n "); 
    }
    else
    {
        w5500_irq_pin->ops->pin_attach_irq(device, 2, PIN_IRQ_MODE_FALLING, rt_hw_w5500_irq_service, RT_NULL);  
        w5500_irq_pin->ops->pin_irq_enable(device, 2, PIN_IRQ_ENABLE, INT_EXTI3_PRIO); 
    }

    w5500_reset();	
    
	w5500_config();
		
    return(0);
}

INIT_ENV_EXPORT(rt_hw_w5500_init);


/* END OF FILE ---------------------------------------------------------------*/

